<template>
  <div class="2xl:px-40 xl:px-20 px-5">
    <h2 class="font-mono text-2xl text-second-500 mb-12">Услуги бухгалтерского и налогового учета</h2>
    <div class="flex flex-col gap-20">
      <IconBanner
        v-for="(item, index) in accounts"
        :key="index"
        :even="((index + 1) & 1) === 0"
        :title="item.title"
        :emoji="item.icon"
        :list="item.list"
      />
    </div>
  </div>
</template>

<script>
  export default {
    computed: {
      accounts() {
        return [
          {
            title: "Заработная плата",
            icon: "money-bag",
            list: [
              "Расчет заработной платы",
              "Расчет больничных, отпускных, компенсационных выплат сотрудников",
              "Контроль за своевременностью выплаты заработной платы и уплаты налогов",
              "Подача отчетности",
            ],
          },
          {
            title: "Кадровый учет и делопроизводство",
            icon: "books",
            list: [
              "Ведение кадровой документации",
              "Военный учет",
              "Штатное расписание",
              "Персональные карты и трудовые книги",
              "Подача кадровой отчетности ",
            ],
          },
          {
            title: "Учет хозяйственных операций",
            icon: "package",
            list: [
              "Подготовка и систематизация первичных документов",
              "Внесение в базу 1С",
              "Ведение складского учета",
              "Списание материалов",
              "Взаиморасчеты с контрагентами",
            ],
          },
          {
            title: "Учет НДС",
            icon: "coin",
            list: [
              "Регистрация налоговых накладных",
              "Учет в системе 1С",
              "Контроль в электронной системе",
              "Формирование декларации",
            ],
          },
          {
            title: "Подача отчетности",
            icon: "page-facing-up",
            list: ["Закрытие финансового периода", "Формирование и подача всех видов отчетности, требуемых заказчиком"],
          },
          {
            title: "Услуги для ФЛП",
            icon: "technologist",
            list: [
              "Ведение книги доходов/расходов",
              "Расчет налогов",
              "Формирование и представление отчетности",
              "Коммуникация с налоговым органом",
              "Консультационные услуги по деятельности ФЛП",
            ],
          },
        ];
      },
    },
  };
</script>
