<template>
  <div class="2xl:px-40 xl:px-20 px-5">
    <h2 class="font-mono text-2xl text-second-500 mb-12">
      {{ $t("other.automation_title") }}
    </h2>
    <div class="flex flex-col gap-20">
      <IconBanner
        v-for="(item, index) in automations"
        :key="index"
        :even="((index + 1) & 1) === 0"
        :title="item.title"
        :emoji="item.icon"
        :list="item.list"
      />
    </div>
  </div>
</template>

<script>
  export default {
    computed: {
      automations() {
        return [
          {
            title: "Автоматизация",
            icon: "direct-hit",
            list: [
              "Автоматизация бизнес процессов на базе учетной системы 1 С и BAS",
              "Доработка учетной системы с учетом специфики предприятия",
              "Документооборот",
              "Обновление доработанных конфигурации",
              "Интеграция данных 1 С с другими решениями",
              "Обмен данными с сайтом или СРМ системой",
              "Программирование любой сложности",
              "Разработка мобильных приложений",
            ],
          },
          {
            title: "Учетная система «Предприниматель 8.0»",
            icon: "laptop",
            list: [
              "Инфомирует про движение и остатки запасов на складе",
              "Отображает объем продаж и валовую прибыль",
              "Ведет учет взаиморасчетов с контрагентами",
              "Формирует все необходимые отчеты о движении и остатках денежных средств",
              "Удобная мобильная версия",
            ],
          },
          {
            title: "Приложение «Денежные средства»",
            icon: "mobile-phone",
            list: [
              "Позволяет отдельно от основной базы формировать движение денежных средств",
              "Демонстрирует актуальные остатки по всем местам хранения средств",
              "Формирует отчеты в разрезе статей движения денежных средств и доходов/расходов",
              "Учитывает выданные займы",
              "Предусматривает мультивалютность",
              "Фиксирует передачу из одной кассы в другую",
            ],
          },
          {
            title: "Обработка «Планирование НДС»",
            icon: "spiral-calendar",
            list: [
              "Дает возможность спрогнозировать потребность в налоговом кредите или уплату в бюджет за месяц, текущий месяц или при продаже всех товаров и запасов в будущем. ",
            ],
          },
        ];
      },
    },
  };
</script>
