<template>
  <div class="2xl:px-40 xl:px-20 px-5">
    <h2 class="font-mono text-2xl text-second-500 mb-12">Весь спектр финансовых услуг</h2>
    <div class="flex flex-col gap-20">
      <IconBanner
        v-for="(item, index) in accounts"
        :key="index"
        :even="((index + 1) & 1) === 0"
        :title="item.title"
        :emoji="item.icon"
        :list="item.list"
      />
    </div>
  </div>
</template>

<script>
  export default {
    computed: {
      accounts() {
        return [
          {
            title: "Финансовый директор онлайн",
            icon: "money-with-wings",
            list: [
              "Формирование и анализ финансовой отчетности",
              "Анализ финансовых показателей",
              "Финансовое моделирование",
              "Консультации по работе с банками и финансовыми учреждениями",
              "Привлечение финансирования",
              "Сопровождение переговоров",
              "Другое",
            ],
          },
          {
            title: "Управленческий учет",
            icon: "bookmark-tabs",
            list: [
              "Внедрение оперативного и управленческого учета с «0»",
              "Автоматизация процесса с целью контроля расходования материальных ресурсов",
              "Экономический и юридический аудит",
              "Формирование ключевых аналитических отчетов для владельца",
            ],
          },
          {
            title: "Планирование и бюджетирование",
            icon: "euro-banknote",
            list: [
              "Организация системы планирования на предприятии",
              "Внедрение системы бюджетирования",
              "Налоговое планирование",
              "План-фактный анализ",
            ],
          },
        ];
      },
    },
  };
</script>
