<template>
  <div class="2xl:px-40 xl:px-20 px-5">
    <h2 class="font-mono text-2xl text-second-500 mb-12">Весь спектр юридических консультаций</h2>
    <div class="flex flex-col gap-20">
      <IconBanner
        v-for="(item, index) in legals"
        :key="index"
        :even="((index + 1) & 1) === 0"
        :title="item.title"
        :emoji="item.icon"
        :list="item.list"
      />
    </div>
  </div>
</template>

<script>
  export default {
    computed: {
      legals() {
        return [
          {
            title: "Налоговое право",
            icon: "page-with-curl",
            list: [
              "Корпоративное налогообложение",
              "Международное структурирование и налогообложение",
              "Консультирование в сфере трансфертного ценообразования",
              "Налогообложение доходов физических лиц",
              "Обжалование ППР / споры с налоговой службой ",
            ],
          },
          {
            title: "Корпоративное и договорное право",
            icon: "graduation-cap",
            list: [
              "Комплексная юридическая проверка субъектов (due diligence)",
              "Налоговое исследования и моделирования в корпоративных отношениях",
              "Структурирование сделок в сфере слияний и поглощений, их дальнейшее сопровождение",
              "Разработка внутренней документации с целью защиты интересов компании и владельцев",
              "Разработка документации для операционной деятельности, типовых договоров и внутренних регламентов, положений или инструкций",
              "Анализ договорных отношений",
              "Юридическое сопровождение сделок и оформления правоотношений в нестандартных ситуациях ",
            ],
          },
          {
            title: "Сопровождение судебных дел /\n Представительство в суде",
            icon: "balance-scale",
            list: [
              "Решение налоговых и таможенных споров в судебном порядке",
              "Корпоративные и договорные споры: выход из состава участников, обжалование решений органов управления, расторжения и признания недействительными сделок, побуждение к их выполнению",
              "Споры о праве собственности",
              "Защита чести, достоинства и деловой репутации трудовые споры",
            ],
          },
          {
            title: "Международное налогообложение",
            icon: "globe-showing-asia-australia",
            list: [
              "Налоговое структурирование бизнеса в Украине и за ее пределами",
              "Комплексное сопровождение международных сделок \n Приведение корпоративных структур и внешнеэкономических операций в соответствии с требованиями MLI и других инициатив плана BEPS",
              "Налоговое планирование и консультирование по отчетности, резидентского статуса, налогообложения доходов из украинских и зарубежных источников",
              "Консультирование по контролируемым иностранным компаниям (КИК) и других аспектов международного налогообложения",
            ],
          },
          {
            title: "Трудовое право",
            icon: "hammer-and-wrench",
            list: [
              "Консультирование по вопросам заключения, изменения или расторжения трудовых контрактов и договоров",
              "Разработка внутренней документации компании (положения, политики, инструкции, договоры о материальной ответственности и т.д.)",
              "Консультирование по вопросам сокращения штата и увольнения, привлечения к ответственности, изменения условий труда",
              "Решение трудовых споров",
            ],
          },
          {
            title: "Исполнительное производство и банкротство",
            icon: "briefcase",
            list: [
              "Юридическая помощь в целях эффективного исполнения судебных решений",
              "Обжалование неправомерных действий частных и государственных исполнителей",
              "Правовая помощь в правоотношениях должников и кредиторов, в частности, в банковском секторе",
              "Правовой аудит компаний при подготовке корпоративной реструктуризации и реструктуризации долга",
              "Сопровождение во время процессов восстановления платежеспособности или банкротства",
              "Структурирование сделок с проблемными активами",
            ],
          },
          {
            title: "Защита бизнеса /\n Уголовное право",
            icon: "magnifying-glass-tilted-left",
            list: [
              "Правовое сопровождение обысков, решение вопросов возвращения изъятого имущества, снятия с него ареста",
              "Консультации по чрезвычайным ситуациям во время проверок",
              "Форензик: расследование мошенничества и помощь в возмещении убытков",
            ],
          },
          {
            title: "Услуги частным клиентам",
            icon: "sports-medal",
            list: [
              "Консультирование по управлению семейным капиталом",
              "Налоговое планирование для частных лиц",
              "Семейные споры: раздел имущества супругов, брачные договоры",
              "Сопровождение наследственных дел",
              "Развод, взыскание и уменьшение размера алиментов",
              "Лишение родительских прав",
              "Установление юридических фактов",
            ],
          },
          {
            title: "Услуги для бизнеса",
            icon: "trophy",
            list: [
              "Регистрация, реорганизация, ликвидация предприятий",
              "Внесение изменений в сведения о юридическом лицеВнесение изменений в сведения о юридическом лице",
              "Подготовка и сопровождение сделок, удостоверяются нотариусами",
              "Регистрация прав на недвижимое имущество",
            ],
          },
        ];
      },
    },
  };
</script>
